app/Http/Controllers/PostController.php

    public function index()
    {
        //
        $posts = Post::latest()->with(['user', 'likes'])->paginate(10);
---
select * from `likes` where `likes`.`post_id` in (215, 216)
select * from `posts` order by `created_at` desc limit 10 offset 0
select * from `users` where `users`.`id` in (10)
select count(*) as aggregate from `posts`

    public function destroy(Post $post)
    {
        //

//        if (!$post->ownedBY(auth()->user())){
//            dd("can't delete");
//        }

        $this->authorize('delete',$post);

        $post->delete();
---
delete from `posts` where `id` = 217